Revit 2027 API
TableCellStyle.GetCellStyleOverrideOptions Method
 Gets cell style override options of this cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableCellStyleOverrideOptions GetCellStyleOverrideOptions()
Public Function GetCellStyleOverrideOptions As TableCellStyleOverrideOptions
public:
TableCellStyleOverrideOptions^ GetCellStyleOverrideOptions()
member GetCellStyleOverrideOptions : unit -> TableCellStyleOverrideOptions
Return Value
TableCellStyleOverrideOptions
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace